// 'use strict';


// // Завдання наступне:
// // Що буде виведено в консоль?

// const fruits = ["Яблуко", "Груша", "Апельсин"];
// const shoppingCart = fruits;
// shoppingCart.push("Банан");
// console.log(fruits.length);

// // Вірна відповідь - 4.
// // Масиви - це складний тип і вони присвоюються за посиланням, обидві змінні посилаються на один і той самий масив.


// // Завдання наступне:
// // Що буде виведено в консоль?

// function fillArray(min, max) {
//     let arr = [];
//     for (let i = min; i <= max; i += 2) {
//       return arr.push(i)
//     }
// }

// console.log(fillArray(2, 10));

// // Вірна відповідь - 1.
// // Функція fillArray на першій ітерації циклу поверне результат роботи push(),
// //  а пуш повертає оновлену довжину масиву після додавання до нього елементів.
// //  Враховуючи, що початковий масив arr у нас був пустий, то пуш додасть до масиву
// //  двійку і поверне 1, так як довжина масиву стане 1.





